results/1/aj-Lenovo-G500s/scotty-0.9.1/PARAM.log
Benchmarking PARAM
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    49.81ms   98.65ms   1.98s    98.58%
    Req/Sec     9.53k     1.08k   12.79k    77.50%
  569293 requests in 30.03s, 111.30MB read
  Socket errors: connect 0, read 0, write 0, timeout 74
Requests/sec:  18958.81
Transfer/sec:      3.71MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    50.50ms  104.62ms   2.00s    98.37%
    Req/Sec     9.54k     2.09k   19.43k    87.12%
  560452 requests in 30.03s, 109.57MB read
  Socket errors: connect 0, read 36, write 0, timeout 141
Requests/sec:  18665.72
Transfer/sec:      3.65MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.74ms   79.56ms   1.99s    98.90%
    Req/Sec     9.65k     1.78k   16.44k    76.33%
  576643 requests in 30.02s, 112.74MB read
  Socket errors: connect 0, read 12, write 0, timeout 176
Requests/sec:  19206.57
Transfer/sec:      3.75MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.63ms   75.11ms   1.99s    98.90%
    Req/Sec     9.48k     0.90k   12.48k    74.33%
  565975 requests in 30.01s, 110.65MB read
  Socket errors: connect 0, read 79, write 0, timeout 191
Requests/sec:  18858.17
Transfer/sec:      3.69MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    46.06ms   82.67ms   1.99s    98.72%
    Req/Sec     9.49k     1.41k   14.37k    77.17%
  566575 requests in 30.02s, 110.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 173
Requests/sec:  18870.47
Transfer/sec:      3.69MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.98ms   94.92ms   1.96s    98.42%
    Req/Sec     9.71k     2.45k   17.88k    76.33%
  580091 requests in 30.03s, 113.41MB read
  Socket errors: connect 0, read 0, write 0, timeout 85
Requests/sec:  19317.88
Transfer/sec:      3.78MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    49.29ms   98.86ms   1.99s    98.36%
    Req/Sec     9.48k     1.29k   14.40k    77.17%
  566457 requests in 30.02s, 110.74MB read
  Socket errors: connect 0, read 119, write 0, timeout 116
Requests/sec:  18868.26
Transfer/sec:      3.69MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    49.27ms   98.48ms   1.99s    98.50%
    Req/Sec     9.35k     0.85k   12.41k    70.67%
  558531 requests in 30.02s, 109.19MB read
  Socket errors: connect 0, read 43, write 0, timeout 148
Requests/sec:  18603.48
Transfer/sec:      3.64MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    48.71ms   98.64ms   1.98s    98.46%
    Req/Sec     9.47k     0.86k   12.11k    72.33%
  565477 requests in 30.02s, 110.55MB read
  Socket errors: connect 0, read 142, write 0, timeout 145
Requests/sec:  18838.69
Transfer/sec:      3.68MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.44ms   78.29ms   2.00s    98.87%
    Req/Sec     9.45k     1.34k   13.70k    78.83%
  564028 requests in 30.02s, 110.27MB read
  Socket errors: connect 0, read 9, write 0, timeout 201
Requests/sec:  18786.36
Transfer/sec:      3.67MB
=================== summary ===================
machine:      aj-Lenovo-G500s
ghc version:  7.8.4
bench target: scotty-0.9.1
bench:        PARAM
bench mode:   30s * 10
average:      18897.44
stdev:        219.88
=================== oneline ===================
aj-Lenovo-G500s,7.8.4,scotty-0.9.1,PARAM,30s,10,18897.44,219.88